DanielMartensson/STM32-Computer/Firmware/STM32-Computer-Firmware/CA7/optee-os-3.19.0-r2/optee-os-stm32mp-3.19.0-stm32mp-r2/core/drivers/clk/clk-stm32mp15.c
	return 0;
}

/*
 * Parses OPP table in DT and finds all parameters supported by the HW
 * platform. If found, the corresponding frequency and voltage values are
 * respectively stored in @pll1_settings structure.
 * Note that @*count has to be set by caller to the effective size allocated
 * for both tables. Its value is then replaced by the number of filled elements.
 */
static int get_all_opp_freqvolt_from_dt(uint32_t *count)
{
	void *fdt = NULL;
	int node = 0;
	int subnode = 0;
	uint32_t idx = 0;

	assert(count);

	fdt = get_embedded_dt();
	node = fdt_node_offset_by_compatible(fdt, -1, DT_OPP_COMPAT);
	if (node < 0)
		return node;

	fdt_for_each_subnode(subnode, fdt, node) {
		uint32_t read_freq = 0;
		uint32_t read_voltage = 0;

		if (get_opp_freqvolt_from_dt_subnode(fdt, subnode, &read_freq,
						     &read_voltage))
			continue;

		if (idx >= *count)
			return -FDT_ERR_NOSPACE;

		pll1_settings.freq[idx] = read_freq;
		pll1_settings.volt[idx] = read_voltage;
		idx++;
	}

	if (!idx)
		return -FDT_ERR_NOTFOUND;

	*count = idx;

	return 0;
}

static int clk_compute_pll1_settings(unsigned long input_freq, int idx)
{
	unsigned long post_divm = 0;
	unsigned long long output_freq = 0;
	unsigned long long freq = 0;
	unsigned long long vco = 0;
	int divm = 0;
	int divn = 0;
	int divp = 0;
	int frac = 0;
	int i = 0;
	unsigned int diff = 0;
	unsigned int best_diff = UINT_MAX;

	output_freq = (unsigned long long)pll1_settings.freq[idx] * 1000U;

	/* Following parameters have always the same value */
	pll1_settings.cfg[idx][PLLCFG_Q] = 0;
	pll1_settings.cfg[idx][PLLCFG_R] = 0;
	pll1_settings.cfg[idx][PLLCFG_O] = PQR(1, 0, 0);

	for (divm = DIVM_MAX; divm >= DIVM_MIN; divm--)	{
		post_divm = input_freq / (unsigned long)(divm + 1);

		if ((post_divm < POST_DIVM_MIN) ||
		    (post_divm > POST_DIVM_MAX))
			continue;

		for (divp = DIVP_MIN; divp <= DIVP_MAX; divp++) {

			freq = output_freq * (divm + 1) * (divp + 1);

			divn = (int)((freq / input_freq) - 1);
			if ((divn < DIVN_MIN) || (divn > DIVN_MAX))
				continue;

			frac = (int)(((freq * FRAC_MAX) / input_freq) -
				     ((divn + 1) * FRAC_MAX));

			/* 2 loops to refine the fractional part */
			for (i = 2; i != 0; i--) {
				if (frac > FRAC_MAX)
					break;

				vco = (post_divm * (divn + 1)) +
				      ((post_divm * (unsigned long long)frac) /
				       FRAC_MAX);

				if ((vco < (VCO_MIN / 2)) ||
				    (vco > (VCO_MAX / 2))) {
					frac++;
					continue;
				}

				freq = vco / (divp + 1);
				if (output_freq < freq)
					diff = (unsigned int)(freq -
							      output_freq);
				else
					diff = (unsigned int)(output_freq -
							      freq);

				if (diff < best_diff)  {
					pll1_settings.cfg[idx][PLLCFG_M] = divm;
					pll1_settings.cfg[idx][PLLCFG_N] = divn;
					pll1_settings.cfg[idx][PLLCFG_P] = divp;
					pll1_settings.frac[idx] = frac;

					if (!diff)
						return 0;

					best_diff = diff;
				}

				frac++;
			}
		}
	}

	if (best_diff == UINT_MAX) {
		pll1_settings.cfg[idx][PLLCFG_O] = 0;
		return -1;
	}

	return 0;
}

static int clk_get_pll1_settings(uint32_t clksrc, int index)
{
	unsigned long input_freq = 0;
	unsigned int i = 0;

	for (i = 0; i < MAX_OPP; i++)
		if (pll1_settings.freq[i] == pll1_settings.freq[index])
			break;

	if (((i == MAX_OPP) &&
	     !stm32mp1_clk_pll1_settings_are_valid()) ||
	    ((i < MAX_OPP) && !pll1_settings.cfg[i][PLLCFG_O])) {
		/*
		 * Either PLL1 settings structure is completely empty,
		 * or these settings are not yet computed: do it.
		 */
		switch (clksrc) {
		case CLK_PLL12_HSI:
			input_freq = _stm32_clock_get_rate(CK_HSI);
			break;
		case CLK_PLL12_HSE:
			input_freq = _stm32_clock_get_rate(CK_HSE);
			break;
		default:
			panic();
		}

		return clk_compute_pll1_settings(input_freq, index);
	}

	if (i < MAX_OPP) {
		if (pll1_settings.cfg[i][PLLCFG_O])
			return 0;

		/*
		 * Index is in range and PLL1 settings are computed:
		 * use content to answer to the request.
		 */
		memcpy(&pll1_settings.cfg[index][0], &pll1_settings.cfg[i][0],
		       sizeof(uint32_t) * PLLCFG_NB);
		pll1_settings.frac[index] = pll1_settings.frac[i];

		return 0;
	}

	return -1;
}

static int clk_save_current_pll1_settings(uint32_t buck1_voltage)
{
	const struct stm32mp1_clk_pll *pll = pll_ref(_PLL1);
	uint32_t rcc_base = stm32_rcc_base();
	uint32_t freq = 0;
	unsigned int i = 0;

	freq = UDIV_ROUND_NEAREST(_stm32_clock_get_rate(CK_MPU), 1000L);

	for (i = 0; i < MAX_OPP; i++)
		if (pll1_settings.freq[i] == freq)
			break;

	if ((i == MAX_OPP) ||
	    ((pll1_settings.volt[i] != buck1_voltage) && buck1_voltage))
		return -1;

	pll1_settings.cfg[i][PLLCFG_M] = (io_read32(rcc_base + pll->pllxcfgr1) &
					  RCC_PLLNCFGR1_DIVM_MASK) >>
					 RCC_PLLNCFGR1_DIVM_SHIFT;

	pll1_settings.cfg[i][PLLCFG_N] = (io_read32(rcc_base + pll->pllxcfgr1) &
					  RCC_PLLNCFGR1_DIVN_MASK) >>
					 RCC_PLLNCFGR1_DIVN_SHIFT;

	pll1_settings.cfg[i][PLLCFG_P] = (io_read32(rcc_base + pll->pllxcfgr2) &
					  RCC_PLLNCFGR2_DIVP_MASK) >>
					 RCC_PLLNCFGR2_DIVP_SHIFT;

	pll1_settings.cfg[i][PLLCFG_Q] = (io_read32(rcc_base + pll->pllxcfgr2) &
					  RCC_PLLNCFGR2_DIVQ_MASK) >>
					 RCC_PLLNCFGR2_DIVQ_SHIFT;

	pll1_settings.cfg[i][PLLCFG_R] = (io_read32(rcc_base + pll->pllxcfgr2) &
					  RCC_PLLNCFGR2_DIVR_MASK) >>
					 RCC_PLLNCFGR2_DIVR_SHIFT;

	pll1_settings.cfg[i][PLLCFG_O] = io_read32(rcc_base + pll->pllxcr) >>
					 RCC_PLLNCR_DIVEN_SHIFT;

	pll1_settings.frac[i] = (io_read32(rcc_base + pll->pllxfracr) &
				 RCC_PLLNFRACR_FRACV_MASK) >>
				RCC_PLLNFRACR_FRACV_SHIFT;

	return i;
}

static uint32_t stm32mp1_clk_get_pll1_current_clksrc(void)
{
	uint32_t value = 0;
	const struct stm32mp1_clk_pll *pll = pll_ref(_PLL1);
	uint32_t rcc_base = stm32_rcc_base();

	value = io_read32(rcc_base + pll->rckxselr);

	switch (value & RCC_SELR_REFCLK_SRC_MASK) {
	case 0:
		return CLK_PLL12_HSI;
	case 1:
		return CLK_PLL12_HSE;
	default:
		panic();
	}
}

int stm32mp1_clk_compute_all_pll1_settings(uint32_t buck1_voltage)
{
	unsigned int i = 0;
	int ret = 0;
	int index = 0;
	uint32_t count = MAX_OPP;
	uint32_t clksrc = 0;

	ret = get_all_opp_freqvolt_from_dt(&count);
	switch (ret) {
	case 0:
		break;
	case -FDT_ERR_NOTFOUND:
		DMSG("Cannot find all OPP info in DT: use default settings.");
		return 0;
	default:
		EMSG("Inconsistent OPP settings found in DT, ignored.");
		return 0;
	}

	index = clk_save_current_pll1_settings(buck1_voltage);

	clksrc = stm32mp1_clk_get_pll1_current_clksrc();

	for (i = 0; i < count; i++) {
		if (index >= 0 && i == (unsigned int)index)
			continue;

		ret = clk_get_pll1_settings(clksrc, i);
		if (ret != 0)
			return ret;
	}

