DanielMartensson/STM32-Computer/Firmware/STM32-Computer-Firmware/CA7/optee-os-3.19.0-r2/optee-os-stm32mp-3.19.0-stm32mp-r2/core/drivers/clk/clk-stm32mp15.c
/*
 * MUX CONFIG
 */
#define MUXRDY_CFG(_id, _offset, _shift, _witdh, _rdy)\
	[(_id)] = {\
			.offset	= (_offset),\
			.shift	= (_shift),\
			.width	= (_witdh),\
			.ready	= (_rdy),\
	}

#define MUX_CFG(_id, _offset, _shift, _witdh)\
	MUXRDY_CFG(_id, _offset, _shift, _witdh, MUX_NO_RDY)

static const struct mux_cfg parent_mp15[MUX_NB] = {
	MUX_CFG(MUX_PLL12,	RCC_RCK12SELR, 0, 2),
	MUX_CFG(MUX_PLL3,	RCC_RCK3SELR, 0, 2),
	MUX_CFG(MUX_PLL4,	RCC_RCK4SELR, 0, 2),
	MUX_CFG(MUX_CKPER,	RCC_CPERCKSELR, 0, 2),
	MUXRDY_CFG(MUX_MPU,	RCC_MPCKSELR, 0, 2, GATE_MPUSRCRDY),
	MUXRDY_CFG(MUX_AXI,	RCC_ASSCKSELR, 0, 3, GATE_AXISSRCRDY),
	MUXRDY_CFG(MUX_MCU,	RCC_MSSCKSELR, 0, 2, GATE_MCUSSRCRDY),
	MUX_CFG(MUX_RTC,	RCC_BDCR, 16, 2),
	MUX_CFG(MUX_SDMMC12,	RCC_SDMMC12CKSELR, 0, 3),
	MUX_CFG(MUX_SPI2S23,	RCC_SPI2S23CKSELR, 0, 3),
	MUX_CFG(MUX_SPI45,	RCC_SPI45CKSELR, 0, 3),
	MUX_CFG(MUX_I2C12,	RCC_I2C12CKSELR, 0, 3),
	MUX_CFG(MUX_I2C35,	RCC_I2C35CKSELR, 0, 3),
	MUX_CFG(MUX_LPTIM23,	RCC_LPTIM23CKSELR, 0, 3),
	MUX_CFG(MUX_LPTIM45,	RCC_LPTIM45CKSELR, 0, 3),
	MUX_CFG(MUX_UART24,	RCC_UART24CKSELR, 0, 3),
	MUX_CFG(MUX_UART35,	RCC_UART35CKSELR, 0, 3),
	MUX_CFG(MUX_UART78,	RCC_UART78CKSELR, 0, 3),
	MUX_CFG(MUX_SAI1,	RCC_SAI1CKSELR, 0, 3),
	MUX_CFG(MUX_ETH,	RCC_ETHCKSELR, 0, 2),
	MUX_CFG(MUX_I2C46,	RCC_I2C46CKSELR, 0, 3),
	MUX_CFG(MUX_RNG2,	RCC_RNG2CKSELR, 0, 2),
	MUX_CFG(MUX_SDMMC3,	RCC_SDMMC3CKSELR, 0, 3),
	MUX_CFG(MUX_FMC,	RCC_FMCCKSELR, 0, 2),
	MUX_CFG(MUX_QSPI,	RCC_QSPICKSELR, 0, 2),
	MUX_CFG(MUX_USBPHY,	RCC_USBCKSELR, 0, 2),
	MUX_CFG(MUX_USBO,	RCC_USBCKSELR, 4, 1),
	MUX_CFG(MUX_SPDIF,	RCC_SPDIFCKSELR, 0, 2),
	MUX_CFG(MUX_SPI2S1,	RCC_SPI2S1CKSELR, 0, 3),
	MUX_CFG(MUX_CEC,	RCC_CECCKSELR, 0, 2),
	MUX_CFG(MUX_LPTIM1,	RCC_LPTIM1CKSELR, 0, 3),
	MUX_CFG(MUX_UART6,	RCC_UART6CKSELR, 0, 3),
	MUX_CFG(MUX_FDCAN,	RCC_FDCANCKSELR, 0, 2),
	MUX_CFG(MUX_SAI2,	RCC_SAI2CKSELR, 0, 3),
	MUX_CFG(MUX_SAI3,	RCC_SAI3CKSELR, 0, 3),
	MUX_CFG(MUX_SAI4,	RCC_SAI4CKSELR, 0, 3),
	MUX_CFG(MUX_ADC,	RCC_ADCCKSELR, 0, 2),
	MUX_CFG(MUX_DSI,	RCC_DSICKSELR, 0, 1),
	MUX_CFG(MUX_RNG1,	RCC_RNG1CKSELR, 0, 2),
	MUX_CFG(MUX_STGEN,	RCC_STGENCKSELR, 0, 2),
	MUX_CFG(MUX_UART1,	RCC_UART1CKSELR, 0, 3),
	MUX_CFG(MUX_SPI6,	RCC_SPI6CKSELR, 0, 3),
	MUX_CFG(MUX_MCO1,	RCC_MCO1CFGR, 0, 3),
	MUX_CFG(MUX_MCO2,	RCC_MCO2CFGR, 0, 3),
};

struct stm32_osc_cfg {
	int osc_id;
};

struct clk_stm32_bypass {
	uint16_t offset;
	uint8_t bit_byp;
	uint8_t bit_digbyp;
};

struct clk_stm32_css {
	uint16_t offset;
	uint8_t bit_css;
};

struct clk_stm32_drive {
	uint16_t offset;
	uint8_t drv_shift;
	uint8_t drv_width;
	uint8_t drv_default;
};

struct clk_oscillator_data {
	const char *name;
	uint16_t gate_id;
	struct clk_stm32_bypass *bypass;
	struct clk_stm32_css *css;
	struct clk_stm32_drive *drive;
};

#define BYPASS(_offset, _bit_byp, _bit_digbyp) (&(struct clk_stm32_bypass){\
	.offset		= (_offset),\
	.bit_byp	= (_bit_byp),\
	.bit_digbyp	= (_bit_digbyp),\
})

#define CSS(_offset, _bit_css) (&(struct clk_stm32_css){\
	.offset		= (_offset),\
	.bit_css	= (_bit_css),\
})

#define DRIVE(_offset, _shift, _width, _default) (&(struct clk_stm32_drive){\
	.offset		= (_offset),\
	.drv_shift	= (_shift),\
	.drv_width	= (_width),\
	.drv_default	= (_default),\
})

#define OSCILLATOR(idx_osc, _name, _gate_id, _bypass, _css, _drive) \
	[(idx_osc)] = (struct clk_oscillator_data){\
		.name		= (_name),\
		.gate_id	= (_gate_id),\
		.bypass		= (_bypass),\
		.css		= (_css),\
		.drive		= (_drive),\
	}

static const struct clk_oscillator_data stm32mp15_osc_data[NB_OSC] = {
	OSCILLATOR(OSC_HSI, "clk-hsi", GATE_HSI,
		   NULL, NULL, NULL),

	OSCILLATOR(OSC_LSI, "clk-lsi", GATE_LSI,
		   NULL, NULL, NULL),

	OSCILLATOR(OSC_CSI, "clk-csi", GATE_CSI,
		   NULL, NULL, NULL),

	OSCILLATOR(OSC_LSE, "clk-lse", GATE_LSE,
		   BYPASS(RCC_BDCR, 1, 3),
		   CSS(RCC_BDCR, 8),
		   DRIVE(RCC_BDCR, 4, 2, 2)),

	OSCILLATOR(OSC_HSE, "clk-hse", GATE_HSE,
		   BYPASS(RCC_OCENSETR, 10, 7),
		   CSS(RCC_OCENSETR, 11),
		   NULL),
	OSCILLATOR(OSC_I2S_CKIN, "i2s_ckin", -1, NULL, NULL, NULL),
	OSCILLATOR(OSC_USB_PHY_48, "ck_usbo_48m", -1, NULL, NULL, NULL),
};

static const struct clk_oscillator_data *clk_oscillator_get_data(int osc_id)
{
	assert(osc_id >= 0 && osc_id < (int)ARRAY_SIZE(stm32mp15_osc_data));

	return &stm32mp15_osc_data[osc_id];
}

static unsigned long clk_stm32_get_rate_oscillateur(int osc_id)
{
	struct clk_stm32_priv *priv = clk_stm32_get_priv();
	struct stm32_clk_platdata *pdata = priv->pdata;
	struct stm32_osci_dt_cfg *osci = &pdata->osci[osc_id];

	return osci->freq;
}

static void
clk_oscillator_set_bypass(struct clk_stm32_priv *priv,
			  const struct clk_oscillator_data *osc_data,
			  bool digbyp, bool bypass)
{
	const struct clk_stm32_bypass *bypass_data = osc_data->bypass;
	uintptr_t address = 0;

	if (!bypass_data)
		return;

	address = priv->base + bypass_data->offset;

	if (digbyp)
		io_setbits32(address, BIT(bypass_data->bit_digbyp));

	if (bypass || digbyp)
		io_setbits32(address, BIT(bypass_data->bit_byp));
}

static void clk_oscillator_set_css(struct clk_stm32_priv *priv,
				   const struct clk_oscillator_data *osc_data,
				   bool css)
{
	struct clk_stm32_css *css_data = osc_data->css;
	uintptr_t address = 0;

	if (!css_data)
		return;

	address = priv->base + css_data->offset;

	if (css)
		io_setbits32(address, BIT(css_data->bit_css));
}

static void clk_oscillator_set_drive(struct clk_stm32_priv *priv,
				     const struct clk_oscillator_data *osc_data,
				     uint8_t lsedrv)
{
	struct clk_stm32_drive *drive_data = osc_data->drive;
	uintptr_t address = 0;
	uint32_t mask = 0;
	uint32_t value = 0;

	if (!drive_data)
		return;

	address = priv->base + drive_data->offset;

	mask = (BIT(drive_data->drv_width) - 1U) << drive_data->drv_shift;

	/*
	 * Warning: not recommended to switch directly from "high drive"
	 * to "medium low drive", and vice-versa.
	 */
	value = (io_read32(address) & mask) >> drive_data->drv_shift;

	while (value != lsedrv) {
		if (value > lsedrv)
			value--;
		else
			value++;

		io_clrsetbits32(address, mask, value << drive_data->drv_shift);
	}
}

