DanielMartensson/STM32-Computer/Firmware/STM32-Computer-Firmware/CA7/optee-os-3.19.0-r2/optee-os-stm32mp-3.19.0-stm32mp-r2/core/drivers/clk/clk-stm32mp15.c
static void stm32_enable_oscillator_hse(struct clk_stm32_priv *priv,
					struct stm32_clk_platdata *pdata)
{
	struct stm32_osci_dt_cfg *osci = &pdata->osci[OSC_HSE];
	const struct clk_oscillator_data *osc_data = NULL;

	if (osci->freq == 0U)
		return;

	osc_data = clk_oscillator_get_data(OSC_HSE);

	clk_oscillator_set_bypass(priv, osc_data,  osci->digbyp, osci->bypass);

	/* Enable clock and wait ready bit */
	if (stm32_gate_rdy_enable(osc_data->gate_id)) {
		EMSG("timeout to enable hse clock");
		panic();
	}

	clk_oscillator_set_css(priv, osc_data, osci->css);
}

static void stm32_enable_oscillator_lse(struct clk_stm32_priv *priv,
					struct stm32_clk_platdata *pdata)
{
	struct stm32_osci_dt_cfg *osci = &pdata->osci[OSC_LSE];
	const struct clk_oscillator_data *osc_data = NULL;

	if (osci->freq == 0U)
		return;

	osc_data = clk_oscillator_get_data(OSC_LSE);

	if (stm32_gate_is_enabled(osc_data->gate_id))
		return;

	clk_oscillator_set_bypass(priv, osc_data, osci->digbyp, osci->bypass);

	clk_oscillator_set_drive(priv, osc_data,  osci->drive);

	/* Enable lse clock, but don't wait ready bit */
	stm32_gate_enable(osc_data->gate_id);
}

static void
stm32_enable_oscillator_lsi(struct clk_stm32_priv *priv __maybe_unused,
			    struct stm32_clk_platdata *pdata)
{
	struct stm32_osci_dt_cfg *osci = &pdata->osci[OSC_LSI];
	const struct clk_oscillator_data *osc_data = NULL;

	if (osci->freq == 0U)
		return;

	osc_data = clk_oscillator_get_data(OSC_LSI);

	/* Enable clock and wait ready bit */
	if (stm32_gate_rdy_enable(osc_data->gate_id)) {
		EMSG("timeout to enable lsi clock");
		panic();
	}
}

static void
stm32_enable_oscillator_csi(struct clk_stm32_priv *priv __maybe_unused,
			    struct stm32_clk_platdata *pdata)
{
	struct stm32_osci_dt_cfg *osci = &pdata->osci[OSC_CSI];
	const struct clk_oscillator_data *osc_data = NULL;

	if (osci->freq == 0U)
		return;

	osc_data = clk_oscillator_get_data(OSC_CSI);

	/* Enable clock and wait ready bit */
	if (stm32_gate_rdy_enable(osc_data->gate_id)) {
		EMSG("timeout to enable csi clock");
		panic();
	}
}

static int stm32_clk_oscillators_lse_set_css(struct clk_stm32_priv *priv,
					     struct stm32_clk_platdata *pdata)

{
	struct stm32_osci_dt_cfg *osci = &pdata->osci[OSC_LSE];
	const struct clk_oscillator_data *osc_data = NULL;

	osc_data = clk_oscillator_get_data(OSC_LSE);

	clk_oscillator_set_css(priv, osc_data, osci->css);

	return 0;
}

static int
stm32_clk_oscillators_wait_lse_ready(struct clk_stm32_priv *priv __maybe_unused,
				     struct stm32_clk_platdata *pdata)
{
	struct stm32_osci_dt_cfg *osci = &pdata->osci[OSC_LSE];
	const struct clk_oscillator_data *osc_data = NULL;

	if (osci->freq == 0U)
		return 0;

	osc_data = clk_oscillator_get_data(OSC_LSE);

	if (stm32_gate_wait_ready(osc_data->gate_id, true))
		return -1;

	return 0;
}

static void stm32_clk_oscillators_enable(struct clk_stm32_priv *priv,
					 struct stm32_clk_platdata *pdata)
{
	stm32_enable_oscillator_hse(priv, pdata);
	stm32_enable_oscillator_lse(priv, pdata);
	stm32_enable_oscillator_lsi(priv, pdata);
	stm32_enable_oscillator_csi(priv, pdata);
}

#define RCC_OFFSET_PLLXCR		0
#define RCC_OFFSET_PLLXCFGR1		4
#define RCC_OFFSET_PLLXCFGR2		8
#define RCC_OFFSET_PLLXFRACR		12
#define RCC_OFFSET_PLLXCSGR		16

struct stm32_clk_pll {
	enum stm32mp1_plltype plltype;
	uint16_t gate_id;
	uint16_t mux_id;
	uint16_t reg_pllxcr;
};

#define CLK_PLL_CFG(_idx, _type, _gate_id, _mux_id, _reg)\
	[(_idx)] = {\
		.gate_id = (_gate_id),\
		.mux_id = (_mux_id),\
		.plltype = (_type),\
		.reg_pllxcr = (_reg),\
	}

static const struct stm32_clk_pll stm32_mp15_clk_pll[_PLL_NB] = {
	CLK_PLL_CFG(_PLL1, PLL_1600, GATE_PLL1, MUX_PLL12, RCC_PLL1CR),
	CLK_PLL_CFG(_PLL2, PLL_1600, GATE_PLL2, MUX_PLL12, RCC_PLL2CR),
	CLK_PLL_CFG(_PLL3, PLL_800, GATE_PLL3, MUX_PLL3, RCC_PLL3CR),
	CLK_PLL_CFG(_PLL4, PLL_800, GATE_PLL4, MUX_PLL4, RCC_PLL4CR),
};

static const struct stm32_clk_pll *clk_stm32_pll_data(unsigned int idx)
{
	return &stm32_mp15_clk_pll[idx];
}

#ifdef CFG_STM32_CLK_DEBUG
static void clk_stm32_debug_display_pll_cfg(int pll_id,
					    struct stm32_pll_dt_cfg *pll)
{
	struct stm32_pll_vco *vco = &pll->vco;
	struct stm32_pll_output *out = &pll->output;
	unsigned int j = 0;

	printf("PLL%d : %s", pll_id + 1, vco->status ? "" : "disabled");

	if (!vco->status) {
		printf("\n");
		return;
	}

	printf(" vco = < ");

	for (j = 0; j < PLL_DIV_MN_NB; j++)
		printf("%d ", vco->div_mn[j]);

	printf("> ");

	printf("frac = 0x%x ", vco->frac);

	printf("src = 0x%x ", vco->src);

	if (vco->csg_enabled) {
		printf("csg = < ");

		for (j = 0; j < PLL_CSG_NB; j++)
			printf("%d ", vco->csg[j]);

		printf("> ");
	}

	printf("output = < ");

	for (j = 0; j < PLL_DIV_PQR_NB; j++)
		printf("%d ", out->output[j]);

	printf(">\n");
}

static void clk_stm32_debug_display_opp_cfg(const char *opp_name,
					    struct stm32_clk_opp_cfg *opp_cfg)
{
	unsigned int i = 0;

	printf("\nOPP %s :\n", opp_name);

	for (i = 0; i < MAX_OPP; i++) {
		if (opp_cfg->frq == 0UL)
			break;

		printf("frequency = %d src = 0x%x div = 0x%x ", opp_cfg->frq,
		       opp_cfg->src, opp_cfg->div);

		clk_stm32_debug_display_pll_cfg(_PLL1, &opp_cfg->pll_cfg);

		opp_cfg++;
	}

	printf("\n");
}

static void clk_stm32_debug_display_opp_dt_cfg(struct clk_stm32_priv *priv)
{
	struct stm32_clk_platdata *pdata = priv->pdata;
	struct stm32_clk_opp_dt_cfg *opp = pdata->opp;

	clk_stm32_debug_display_opp_cfg("st,ck_mpu", opp->mpu_opp);
	clk_stm32_debug_display_opp_cfg("st,ck_axi", pdata->opp->axi_opp);
	clk_stm32_debug_display_opp_cfg("st,ck_mcu", pdata->opp->mcu_opp);
}

static void clk_stm32_debug_display_pll_dt_cfg(struct clk_stm32_priv *priv)
{
	struct stm32_clk_platdata *pdata = priv->pdata;
	size_t i = 0;

	for (i = _PLL1; i < pdata->npll; i++)
		clk_stm32_debug_display_pll_cfg(i, &pdata->pll[i]);
}

static void clk_stm32_debug_display_osc_dt_cfg(struct clk_stm32_priv *priv)
{
	struct stm32_clk_platdata *pdata = priv->pdata;
	size_t nb = pdata->nosci;
	size_t i = 0;

	printf("\nNumber of oscillators = %d\n", nb);

