DanielMartensson/STM32-Computer/Firmware/STM32-Computer-Firmware/CA7/optee-os-3.19.0-r2/optee-os-stm32mp-3.19.0-stm32mp-r2/core/drivers/clk/clk-stm32mp15.c
	for (i = 0; i < nb; i++) {
		struct stm32_osci_dt_cfg *osc = &pdata->osci[i];
		const struct clk_oscillator_data *osc_data = NULL;

		osc_data = clk_oscillator_get_data(i);

		printf("%s %ld bypass = %d digbyp = %d css = %d drive = %d\n",
		       osc_data->name,
		       osc->freq,
		       osc->bypass,
		       osc->digbyp,
		       osc->css,
		       osc->drive);
	}
}

static void clk_stm32_debug_display_src_dt_cfg(struct clk_stm32_priv *priv)
{
	struct stm32_clk_platdata *pdata = priv->pdata;
	size_t i = 0;

	printf("nb st,clksrc = %d\n", pdata->nclksrc);

	for (i = 0; i < pdata->nclksrc; i++)
		printf("\t0x%x\n", pdata->clksrc[i]);

	printf("\n");
}

static void clk_stm32_debug_display_div_dt_cfg(struct clk_stm32_priv *priv)
{
	struct stm32_clk_platdata *pdata = priv->pdata;
	size_t i = 0;

	printf("nb st,clkdiv = %d\n", pdata->nclkdiv);

	for (i = 0; i < pdata->nclkdiv; i++)
		printf("\t%d\n", pdata->clkdiv[i]);

	printf("\n");
}

static void clk_stm32_debug_display_pdata(void)
{
	struct clk_stm32_priv *priv = clk_stm32_get_priv();

	clk_stm32_debug_display_pll_dt_cfg(priv);
	clk_stm32_debug_display_opp_dt_cfg(priv);
	clk_stm32_debug_display_osc_dt_cfg(priv);
	clk_stm32_debug_display_src_dt_cfg(priv);
	clk_stm32_debug_display_div_dt_cfg(priv);
}
#endif

static int fdt_clk_stm32_parse_oscillator(const void *fdt, int node,
					  const char *name,
					  struct stm32_osci_dt_cfg *osci)
{
	int subnode = 0;

	fdt_for_each_subnode(subnode, fdt, node) {
		const char *cchar = NULL;
		const fdt32_t *cuint = NULL;
		int ret = 0;

		cchar = fdt_get_name(fdt, subnode, &ret);
		if (!cchar)
			return ret;

		if (strncmp(cchar, name, (size_t)ret) ||
		    _fdt_get_status(fdt, subnode) == DT_STATUS_DISABLED)
			continue;

		cuint = fdt_getprop(fdt, subnode, "clock-frequency", &ret);
		if (!cuint)
			panic();

		osci->freq = fdt32_to_cpu(*cuint);

		if (fdt_getprop(fdt, subnode, "st,bypass", NULL))
			osci->bypass = true;

		if (fdt_getprop(fdt, subnode, "st,digbypass", NULL))
			osci->digbyp = true;

		if (fdt_getprop(fdt, subnode, "st,css", NULL))
			osci->css = true;

		osci->drive = _fdt_read_uint32_default(fdt, subnode, "st,drive",
						       LSEDRV_MEDIUM_HIGH);

		return 0;
	}

	return -FDT_ERR_NOTFOUND;
}

static int fdt_stm32_clk_parse_all_oscillator(const void *fdt,
					      int node __maybe_unused,
					      struct stm32_clk_platdata *pdata)
{
	int fdt_err = 0;
	size_t i = 0;
	int osc_node = 0;

	osc_node = fdt_path_offset(fdt, "/clocks");
	if (osc_node < 0)
		return -FDT_ERR_NOTFOUND;

	for (i = 0; i < NB_OSC; i++) {
		struct stm32_osci_dt_cfg *osci = &pdata->osci[i];
		const struct clk_oscillator_data *osc_data = NULL;

		osc_data = clk_oscillator_get_data(i);

		fdt_err = fdt_clk_stm32_parse_oscillator(fdt, osc_node,
							 osc_data->name, osci);
		if (fdt_err < 0)
			osci->freq = 0UL;
	}

	return 0;
}

static int fdt_clk_stm32_load_vco_config(const void *fdt, int subnode,
					 struct stm32_pll_vco *vco)
{
	int ret = 0;

	ret = _fdt_read_uint32_array(fdt, subnode, "divmn", vco->div_mn,
				     PLL_DIV_MN_NB);
	if (ret != 0)
		return ret;

	ret = _fdt_read_uint32_array(fdt, subnode, "csg", vco->csg,
				     PLL_CSG_NB);

	vco->csg_enabled = (ret == 0);

	if (ret == -FDT_ERR_NOTFOUND)
		ret = 0;

	if (ret != 0)
		return ret;

	vco->status = RCC_PLLNCR_DIVPEN | RCC_PLLNCR_DIVQEN |
		      RCC_PLLNCR_DIVREN | RCC_PLLNCR_PLLON;

	vco->frac = _fdt_read_uint32_default(fdt, subnode, "frac", 0);

	vco->src = _fdt_read_uint32_default(fdt, subnode, "src", UINT32_MAX);

	return 0;
}

static int fdt_clk_stm32_load_output_config(const void *fdt, int subnode,
					    struct stm32_pll_output *output)
{
	return _fdt_read_uint32_array(fdt, subnode, "st,pll_div_pqr",
				      output->output, (int)PLL_DIV_PQR_NB);
}

static int fdt_clk_stm32_parse_pll(const void *fdt, int subnode,
				   struct stm32_pll_dt_cfg *pll)
{
	const fdt32_t *cuint = NULL;
	int subnode_pll = 0;
	int subnode_vco = 0;
	int err = 0;

	cuint = fdt_getprop(fdt, subnode, "st,pll", NULL);
	if (!cuint)
		return -FDT_ERR_NOTFOUND;

	subnode_pll = fdt_node_offset_by_phandle(fdt, fdt32_to_cpu(*cuint));
	if (subnode_pll < 0)
		return -FDT_ERR_NOTFOUND;

	cuint = fdt_getprop(fdt, subnode_pll, "st,pll_vco", NULL);
	if (!cuint)
		return -FDT_ERR_NOTFOUND;

	subnode_vco = fdt_node_offset_by_phandle(fdt, fdt32_to_cpu(*cuint));
	if (subnode_vco < 0)
		return -FDT_ERR_NOTFOUND;

	err = fdt_clk_stm32_load_vco_config(fdt, subnode_vco, &pll->vco);
	if (err != 0)
		return err;

	err = fdt_clk_stm32_load_output_config(fdt, subnode_pll, &pll->output);
	if (err != 0)
		return err;

	return 0;
}

#define RCC_PLL_NAME_SIZE	12

static int fdt_stm32_clk_parse_all_pll(const void *fdt, int node,
				       struct stm32_clk_platdata *pdata)
{
	size_t i = 0;

	for (i = _PLL1; i < pdata->npll; i++) {
		struct stm32_pll_dt_cfg *pll = pdata->pll + i;
		char name[RCC_PLL_NAME_SIZE] = { 0 };
		int subnode = 0;
		int err = 0;

		err = snprintf(name, sizeof(name), "st,pll@%d", i);
		if (err < 0 || (size_t)err >= sizeof(name))
			panic();

		subnode = fdt_subnode_offset(fdt, node, name);
		if (subnode < 0)
			continue;

		err = fdt_clk_stm32_parse_pll(fdt, subnode, pll);
		if (err != 0)
			panic();
	}

	return 0;
}

static int fdt_stm32_clk_parse_opp(const void *fdt, int node,
				   const char *opp_name,
				   struct stm32_clk_opp_cfg *opp_cfg)
{
	int subnode = 0;
	unsigned int nb_opp = 0;
	int ret = 0;

	node = fdt_subnode_offset(fdt, node, opp_name);
	if (node == -FDT_ERR_NOTFOUND)
		return 0;
	if (node < 0)
		return node;

	fdt_for_each_subnode(subnode, fdt, node) {
		if (nb_opp >= MAX_OPP) {
			EMSG("%d MAX opp in %s", MAX_OPP, opp_name);
			panic();
		}

		opp_cfg->frq = _fdt_read_uint32_default(fdt, subnode,
							"hz",
							UINT32_MAX);

		opp_cfg->src = _fdt_read_uint32_default(fdt, subnode,
							"st,clksrc",
							UINT32_MAX);

		opp_cfg->div = _fdt_read_uint32_default(fdt, subnode,
							"st,clkdiv",
							UINT32_MAX);

		ret = fdt_clk_stm32_parse_pll(fdt, subnode, &opp_cfg->pll_cfg);
		if (ret)
			return ret;

		opp_cfg++;
		nb_opp++;
	}

