DanielMartensson/STM32-Computer/Firmware/STM32-Computer-Firmware/CA7/optee-os-3.19.0-r2/optee-os-stm32mp-3.19.0-stm32mp-r2/core/drivers/clk/clk-stm32mp15.c
	/* Configure with expected clock source */
	ret = stm32_clk_source_configure(priv);
	if (ret != 0)
		panic();

	/* Configure LSE CSS after RTC source configuration */
	ret = stm32_clk_oscillators_lse_set_css(priv, pdata);
	if (ret != 0)
		panic();

	/* Software Self-Refresh mode (SSR) during DDR initilialization */
	io_clrsetbits32(priv->base + RCC_DDRITFCR, RCC_DDRITFCR_DDRCKMOD_MASK,
			RCC_DDRITFCR_DDRCKMOD_SSR <<
			RCC_DDRITFCR_DDRCKMOD_SHIFT);

	return 0;
}

static struct stm32_pll_dt_cfg mp15_pll[_PLL_NB];
static struct stm32_clk_opp_dt_cfg mp15_clk_opp;
static struct stm32_osci_dt_cfg mp15_osci[NB_OSC];
static uint32_t mp15_clksrc[MUX_NB];
static uint32_t mp15_clkdiv[DIV_NB];

static struct stm32_clk_platdata stm32mp15_clock_pdata = {
	.osci		= mp15_osci,
	.nosci		= NB_OSC,
	.pll		= mp15_pll,
	.opp		= &mp15_clk_opp,
	.npll		= _PLL_NB,
	.clksrc		= mp15_clksrc,
	.nclksrc	= MUX_NB,
	.clkdiv		= mp15_clkdiv,
	.nclkdiv	= DIV_NB,
};

static struct clk_stm32_priv stm32mp15_clock_data = {
	.muxes			= parent_mp15,
	.nb_muxes		= ARRAY_SIZE(parent_mp15),
	.gates			= gates_mp15,
	.nb_gates		= ARRAY_SIZE(gates_mp15),
	.div			= dividers_mp15,
	.nb_div			= ARRAY_SIZE(dividers_mp15),
	.pdata			= &stm32mp15_clock_pdata,
};
DECLARE_KEEP_PAGER(stm32mp15_clock_data);

static TEE_Result stm32mp1_clock_provider_probe(const void *fdt, int offs,
						const void *compat_data)
{
	TEE_Result res = TEE_ERROR_GENERIC;
	struct clk_stm32_priv *priv = &stm32mp15_clock_data;
	struct stm32_clk_platdata *pdata = &stm32mp15_clock_pdata;
	int rc = 0;
	int subnode = 0;

	if (compat_data == &non_secure_rcc)
		disable_rcc_tzen();
	else
		enable_rcc_tzen();

	rc = fdt_stm32_clk_parse(fdt, offs, pdata);
	if (rc) {
		EMSG("Failed to parse clock node: %d", rc);
		return TEE_ERROR_GENERIC;
	}

	fdt_for_each_subnode(subnode, fdt, offs) {
		res = dt_driver_maybe_add_probe_node(fdt, subnode);
		if (res) {
			EMSG("Failed on node %s with %#"PRIx32,
			     fdt_get_name(fdt, subnode, NULL), res);
			return res;
		}
	}

	res = clk_stm32_init(priv, stm32_rcc_base());
	if (res)
		return res;

#ifdef CFG_STM32_CLK_DEBUG
	clk_stm32_debug_display_pdata();
#endif
	rc = stm32mp1_init_clock_tree(priv, pdata);
	if (rc)
		return TEE_ERROR_GENERIC;

	res = register_stm32mp1_clocks();
	if (res) {
		EMSG("Failed to register clocks: %#"PRIx32, res);
		panic();
	}

	res = clk_dt_register_clk_provider(fdt, offs, stm32mp1_clk_dt_get_clk,
					   NULL);
	if (res) {
		EMSG("Failed to register clock provider: %#"PRIx32, res);
		panic();
	}

	enable_static_secure_clocks();
	save_current_opp();

	register_pm_core_service_cb(stm32_clock_pm, NULL,
				    "stm32mp15-clk-service");

	return TEE_SUCCESS;
}

static const struct dt_device_match stm32mp1_clock_match_table[] = {
	{  .compatible = "st,stm32mp1-rcc", .compat_data = &non_secure_rcc, },
	{  .compatible = "st,stm32mp1-rcc-secure", },
	{ }
};

DEFINE_DT_DRIVER(stm32mp1_clock_dt_driver) = {
	.name = "stm32mp1_clock",
	.type = DT_DRIVER_CLK,
	.match_table = stm32mp1_clock_match_table,
	.probe = stm32mp1_clock_provider_probe,
};
#else /*CFG_DRIVERS_CLK_DT*/
static void stm32_clock_enable(unsigned long clock_id)
{
	int index = clock_id_to_gate_index(clock_id);

	if (index >= 0) {
		__clk_enable(stm32mp1_clk_gate + index);

		/* Make sure the clock is enable before to return to caller */
		dsb();
	}

	assert(clock_id_to_always_on_index(clock_id) >= 0);
}

static void enable_static_secure_clocks(void)
{
	unsigned int idx = 0;
	const unsigned long secure_enable[] = {
		DDRC1, DDRC1LP, DDRC2, DDRC2LP, DDRPHYC, DDRPHYCLP, DDRCAPB,
		AXIDCG, DDRPHYCAPB, DDRPHYCAPBLP, TZPC, TZC1, TZC2, STGEN_K,
		BSEC,
	};
	for (idx = 0; idx < ARRAY_SIZE(secure_enable); idx++) {
		stm32_clock_enable(secure_enable[idx]);
		stm32mp_register_clock_parents_secure(secure_enable[idx]);
	}

	if (CFG_TEE_CORE_NB_CORE > 1)
		stm32_clock_enable(RTCAPB);
}

int stm32mp1_clk_compute_all_pll1_settings(uint32_t buck1_voltage __unused)
{
	return 0;
}

void stm32mp1_clk_lp_save_opp_pll1_settings(uint8_t *data __unused,
					    size_t size __unused)
{
}

bool stm32mp1_clk_pll1_settings_are_valid(void)
{
	return false;
}

static void enable_static_secure_clocks(void)
{
}

static TEE_Result stm32mp1_clk_early_init(void)
{
	TEE_Result __maybe_unused res = TEE_ERROR_GENERIC;

	res = register_stm32mp1_clocks();
	if (res) {
		EMSG("Failed to register clocks: %#"PRIx32, res);
		panic();
	}

	enable_static_secure_clocks();
	save_current_opp();

	return TEE_SUCCESS;
}

service_init(stm32mp1_clk_early_init);
#endif /* CFG_DRIVERS_CLK_DT */

#endif /* CFG_DRIVERS_CLK */

/* Start MPU OPP */

/*
 * Check if PLL1 can be configured on the fly.
 * @result  (-1) => config on the fly is not possible.
 *          (0)  => config on the fly is possible.
 *          (+1) => same parameters as those in place, no need to reconfig.
 * Return value is 0 if no error.
 */
static int is_pll_config_on_the_fly(enum stm32mp1_pll_id pll_id,
				    uint32_t *pllcfg, uint32_t fracv,
				    int *result)
{
	const struct stm32mp1_clk_pll *pll = pll_ref(pll_id);
	uintptr_t rcc_base = stm32_rcc_base();
	uint32_t fracr = 0;
	uint32_t value = 0;
	int ret = 0;

	ret = pll_compute_pllxcfgr1(pll, pllcfg, &value);
	if (ret)
		return ret;

	if (io_read32(rcc_base + pll->pllxcfgr1) != value) {
		/* Different DIVN/DIVM, can't config on the fly */
		*result = -1;
		return 0;
	}

	*result = true;

	fracr = fracv << RCC_PLLNFRACR_FRACV_SHIFT;
	fracr |= RCC_PLLNFRACR_FRACLE;
	value = pll_compute_pllxcfgr2(pllcfg);

	if ((io_read32(rcc_base + pll->pllxfracr) == fracr) &&
	    (io_read32(rcc_base + pll->pllxcfgr2) == value))
		/* Same parameters, no need to config */
		*result = 1;
	else
		*result = 0;

	return 0;
}

static int stm32mp1_get_mpu_div(uint32_t freq_khz)
{
	unsigned long freq_pll1_p;
	unsigned long div;

	freq_pll1_p = get_clock_rate(_PLL1_P) / 1000UL;
	if ((freq_pll1_p % freq_khz) != 0U)
		return -1;

	div = freq_pll1_p / freq_khz;

	switch (div) {
	case 1UL:
	case 2UL:
	case 4UL:
	case 8UL:
	case 16UL:
		return __builtin_ffs(div) - 1;
	default:
		return -1;
	}
}

