DanielMartensson/STM32-Computer/Firmware/STM32-Computer-Firmware/CA7/optee-os-3.19.0-r2/optee-os-stm32mp-3.19.0-stm32mp-r2/core/drivers/clk/clk-stm32mp15.c
/* Configure PLL1 from input frequency OPP parameters */
static int pll1_config_from_opp_khz(uint32_t freq_khz)
{
	unsigned int idx = 0;
	int ret = 0;
	int div = 0;
	int config_on_the_fly = -1;

	for (idx = 0; idx < MAX_OPP; idx++)
		if (pll1_settings.freq[idx] == freq_khz)
			break;

	if (idx == MAX_OPP)
		return -1;

	div = stm32mp1_get_mpu_div(freq_khz);
	switch (div) {
	case -1:
		break;
	case 0:
		return stm32_clk_configure_mux(CLK_MPU_PLL1P);
	default:
		if (!stm32_div_set_value(DIV_MPU, div))
			return stm32_clk_configure_mux(CLK_MPU_PLL1P_DIV);

		return -1;
	}

	ret = is_pll_config_on_the_fly(_PLL1, &pll1_settings.cfg[idx][0],
				       pll1_settings.frac[idx],
				       &config_on_the_fly);
	if (ret)
		return ret;

	if (config_on_the_fly == 1)
		return 0;

	if (config_on_the_fly == -1) {
		/* Switch to HSI and stop PLL1 before reconfiguration */
		ret = stm32_clk_configure_mux(CLK_MPU_HSI);
		if (ret)
			return ret;

		ret = pll_stop(_PLL1);
		if (ret)
			return ret;
	}

	ret = pll_config(_PLL1, &pll1_settings.cfg[idx][0],
			 pll1_settings.frac[idx]);
	if (ret)
		return ret;

	if (config_on_the_fly == -1) {
		/* Start PLL1 and switch back to after reconfiguration */
		pll_start(_PLL1);

		ret = pll_output(_PLL1, pll1_settings.cfg[idx][PLLCFG_O]);
		if (ret)
			return ret;

		ret = stm32_clk_configure_mux(CLK_MPU_PLL1P);
		if (ret)
			return ret;
	}

	return 0;
}

TEE_Result stm32mp1_set_opp_khz(uint32_t freq_khz)
{
	uint32_t mpu_src = 0;
	DMSG("freq_khz = %i", freq_khz);
	if (freq_khz == current_opp_khz)
		return TEE_SUCCESS;

	if (!stm32mp1_clk_pll1_settings_are_valid()) {
		/*
		 * No OPP table in DT or an error occurred during PLL1
		 * settings computation, system can only work on current
		 * operating point so return error.
		 */
		DMSG("PLL1 settings are valid! OK!");
		return TEE_ERROR_NO_DATA;
	}

	/* Check that PLL1 is MPU clock source */
	mpu_src = io_read32(stm32_rcc_base() + RCC_MPCKSELR) &
		RCC_SELR_SRC_MASK;
	DMSG("(mpu_src != RCC_MPCKSELR_PLL) && (mpu_src != RCC_MPCKSELR_PLL_MPUDIV) = %i ", (mpu_src != RCC_MPCKSELR_PLL) && (mpu_src != RCC_MPCKSELR_PLL_MPUDIV));
	if ((mpu_src != RCC_MPCKSELR_PLL) &&
	    (mpu_src != RCC_MPCKSELR_PLL_MPUDIV)){
		DMSG("TEE ERROR BAD STATE");
		return TEE_ERROR_BAD_STATE;
	}

	if (pll1_config_from_opp_khz(freq_khz)) {
		/* Restore original value */
		if (pll1_config_from_opp_khz(current_opp_khz)) {
			EMSG("No CPU operating point can be set");
			panic();
		}
		DMSG("pll1_config_from_opp_khz = TEE ERROR GENERIC");
		return TEE_ERROR_GENERIC;
	}

	current_opp_khz = freq_khz;
	DMSG("TEE_SUCCESS: current_opp_khz = %i", current_opp_khz);

	return TEE_SUCCESS;
}

int stm32mp1_round_opp_khz(uint32_t *freq_khz)
{
	unsigned int i = 0;
	uint32_t round_opp = 0;

	if (!stm32mp1_clk_pll1_settings_are_valid()) {
		/*
		 * No OPP table in DT, or an error occurred during PLL1
		 * settings computation, system can only work on current
		 * operating point, so return current CPU frequency.
		 */
		*freq_khz = current_opp_khz;

		return 0;
	}

	for (i = 0; i < MAX_OPP; i++)
		if ((pll1_settings.freq[i] <= *freq_khz) &&
		    (pll1_settings.freq[i] > round_opp))
			round_opp = pll1_settings.freq[i];

	*freq_khz = round_opp;

	return 0;
}
/* End MPU OPP */

struct soc_stop_context {
	uint32_t pll3cr;
	uint32_t pll4cr;
	uint32_t mssckselr;
	uint32_t mcudivr;
};

static struct soc_stop_context soc_stop_ctx;

static void save_pll34_state(void)
{
	uintptr_t rcc_base = stm32_rcc_base();
	struct soc_stop_context *ctx = &soc_stop_ctx;

	ctx->pll3cr = io_read32(rcc_base + RCC_PLL3CR);
	ctx->pll4cr = io_read32(rcc_base + RCC_PLL4CR);
}

static void save_mcu_subsys_clocks(void)
{
	uintptr_t rcc_base = stm32_rcc_base();
	struct soc_stop_context *ctx = &soc_stop_ctx;

	ctx->mssckselr = io_read32(rcc_base + RCC_MSSCKSELR);
	ctx->mcudivr = io_read32(rcc_base + RCC_MCUDIVR) &
		       RCC_MCUDIV_MASK;
}

static void restore_pll34_state(void)
{
	struct soc_stop_context *ctx = &soc_stop_ctx;

	/* Let PLL4 start while we're starting and waiting for PLL3 */
	if (ctx->pll4cr & RCC_PLLNCR_PLLON)
		pll_start(_PLL4);

	if (ctx->pll3cr & RCC_PLLNCR_PLLON) {
		pll_start(_PLL3);
		if (pll_output(_PLL3, ctx->pll3cr >> RCC_PLLNCR_DIVEN_SHIFT)) {
			EMSG("Failed to restore PLL3");
			panic();
		}
	}

	if (ctx->pll4cr & RCC_PLLNCR_PLLON) {
		if (pll_output(_PLL4, ctx->pll4cr >> RCC_PLLNCR_DIVEN_SHIFT)) {
			EMSG("Failed to restore PLL4");
			panic();
		}
	}
}

static void restore_mcu_subsys_clocks(void)
{
	uintptr_t rcc_base = stm32_rcc_base();
	struct soc_stop_context *ctx = &soc_stop_ctx;

	io_write32(rcc_base + RCC_MSSCKSELR, ctx->mssckselr);

	if (stm32_div_set_value(DIV_MCU, ctx->mcudivr)) {
		EMSG("Failed to restore MCUDIVR");
		panic();
	}
}

/*
 * Sequence to save/restore the non-secure configuration.
 * Restoring clocks and muxes need IPs to run on kernel clock
 * hence on configuration is restored at resume, kernel clock
 * should be disable: this mandates secure access.
 *
 * backup_mux*_cfg for the clock muxes.
 * backup_clock_sc_cfg for the set/clear clock gating registers
 * backup_clock_cfg for the regular full write registers
 */

struct backup_mux_cfg {
	uint16_t offset;
	uint8_t value;
	uint8_t bit_len;
};

#define MUXCFG(_offset, _bit_len) \
	{ .offset = (_offset), .bit_len = (_bit_len) }

struct backup_mux_cfg backup_mux0_cfg[] = {
	MUXCFG(RCC_SDMMC12CKSELR, 3),
	MUXCFG(RCC_SPI2S23CKSELR, 3),
	MUXCFG(RCC_SPI45CKSELR, 3),
	MUXCFG(RCC_I2C12CKSELR, 3),
	MUXCFG(RCC_I2C35CKSELR, 3),
	MUXCFG(RCC_LPTIM23CKSELR, 3),
	MUXCFG(RCC_LPTIM45CKSELR, 3),
	MUXCFG(RCC_UART24CKSELR, 3),
	MUXCFG(RCC_UART35CKSELR, 3),
	MUXCFG(RCC_UART78CKSELR, 3),
	MUXCFG(RCC_SAI1CKSELR, 3),
	MUXCFG(RCC_ETHCKSELR, 2),
	MUXCFG(RCC_I2C46CKSELR, 3),
	MUXCFG(RCC_RNG2CKSELR, 2),
	MUXCFG(RCC_SDMMC3CKSELR, 3),
	MUXCFG(RCC_FMCCKSELR, 2),
	MUXCFG(RCC_QSPICKSELR, 2),
	MUXCFG(RCC_USBCKSELR, 2),
	MUXCFG(RCC_SPDIFCKSELR, 2),
	MUXCFG(RCC_SPI2S1CKSELR, 3),
	MUXCFG(RCC_CECCKSELR, 2),
	MUXCFG(RCC_LPTIM1CKSELR, 3),
	MUXCFG(RCC_UART6CKSELR, 3),
	MUXCFG(RCC_FDCANCKSELR, 2),
	MUXCFG(RCC_SAI2CKSELR, 3),
	MUXCFG(RCC_SAI3CKSELR,  3),
	MUXCFG(RCC_SAI4CKSELR, 3),
	MUXCFG(RCC_ADCCKSELR, 2),
	MUXCFG(RCC_DSICKSELR, 1),
	MUXCFG(RCC_CPERCKSELR, 2),
	MUXCFG(RCC_RNG1CKSELR, 2),
	MUXCFG(RCC_STGENCKSELR, 2),
	MUXCFG(RCC_UART1CKSELR, 3),
	MUXCFG(RCC_SPI6CKSELR, 3),
};

struct backup_mux_cfg backup_mux4_cfg[] = {
	MUXCFG(RCC_USBCKSELR, 1),
};

static void backup_mux_cfg(void)
{
	struct backup_mux_cfg *cfg = backup_mux0_cfg;
	size_t count = ARRAY_SIZE(backup_mux0_cfg);
	size_t i = 0;
	uintptr_t base = stm32_rcc_base();

	for (i = 0; i < count; i++)
		cfg[i].value = io_read32(base + cfg[i].offset) &
				GENMASK_32(cfg[i].bit_len - 1, 0);

	cfg = backup_mux4_cfg;
	count = ARRAY_SIZE(backup_mux4_cfg);

	for (i = 0; i < count; i++)
		cfg[i].value = io_read32(base + cfg[i].offset) &
				GENMASK_32(4 + cfg[i].bit_len - 1, 4);
}

