DanielMartensson/STM32-Computer/Firmware/STM32-Computer-Firmware/CA7/optee-os-3.19.0-r2/optee-os-stm32mp-3.19.0-stm32mp-r2/core/drivers/clk/clk-stm32mp15.c
static void restore_mux_cfg(void)
{
	struct backup_mux_cfg *cfg = backup_mux0_cfg;
	size_t count = ARRAY_SIZE(backup_mux0_cfg);
	size_t i = 0;
	uintptr_t base = stm32_rcc_base();

	for (i = 0; i < count; i++)
		io_clrsetbits32(base + cfg[i].offset,
				GENMASK_32(cfg[i].bit_len - 1, 0),
				cfg[i].value);

	cfg = backup_mux4_cfg;
	count = ARRAY_SIZE(backup_mux4_cfg);

	for (i = 0; i < count; i++)
		io_clrsetbits32(base + cfg[i].offset,
				GENMASK_32(4 + cfg[i].bit_len - 1, 4),
				cfg[i].value);
}

/* Structure is used for set/clear registers and for regular registers */
struct backup_clock_cfg {
	uint32_t offset;
	uint32_t value;
};

static struct backup_clock_cfg backup_clock_sc_cfg[] = {
	{ .offset = RCC_MP_APB1ENSETR },
	{ .offset = RCC_MP_APB2ENSETR },
	{ .offset = RCC_MP_APB3ENSETR },
	{ .offset = RCC_MP_APB4ENSETR },
	{ .offset = RCC_MP_APB5ENSETR },
	{ .offset = RCC_MP_AHB2ENSETR },
	{ .offset = RCC_MP_AHB3ENSETR },
	{ .offset = RCC_MP_AHB4ENSETR },
	{ .offset = RCC_MP_AHB5ENSETR },
	{ .offset = RCC_MP_AHB6ENSETR },
	{ .offset = RCC_MP_MLAHBENSETR },
};

static struct backup_clock_cfg backup_clock_cfg[] = {
	{ .offset = RCC_TZCR},
	{ .offset = RCC_MCO1CFGR },
	{ .offset = RCC_MCO2CFGR },
	{ .offset = RCC_PLL3CR },
	{ .offset = RCC_PLL4CR },
	{ .offset = RCC_PLL4CFGR2 },
	{ .offset = RCC_MCUDIVR },
	{ .offset = RCC_MSSCKSELR },
};

static void backup_sc_cfg(void)
{
	struct backup_clock_cfg *cfg = backup_clock_sc_cfg;
	size_t count = ARRAY_SIZE(backup_clock_sc_cfg);
	size_t i = 0;
	uintptr_t base = stm32_rcc_base();

	for (i = 0; i < count; i++)
		cfg[i].value = io_read32(base + cfg[i].offset);
}

static void restore_sc_cfg(void)
{
	struct backup_clock_cfg *cfg = backup_clock_sc_cfg;
	size_t count = ARRAY_SIZE(backup_clock_sc_cfg);
	size_t i = 0;
	uintptr_t base = stm32_rcc_base();

	for (i = 0; i < count; i++) {
		io_write32(base + cfg[i].offset, cfg[i].value);
		io_write32(base + cfg[i].offset + RCC_MP_ENCLRR_OFFSET,
			   ~cfg[i].value);
	}
}

static void backup_regular_cfg(void)
{
	struct backup_clock_cfg *cfg = backup_clock_cfg;
	size_t count = ARRAY_SIZE(backup_clock_cfg);
	size_t i = 0;
	uintptr_t base = stm32_rcc_base();

	for (i = 0; i < count; i++)
		cfg[i].value = io_read32(base + cfg[i].offset);
}

static void restore_regular_cfg(void)
{
	struct backup_clock_cfg *cfg = backup_clock_cfg;
	size_t count = ARRAY_SIZE(backup_clock_cfg);
	size_t i = 0;
	uintptr_t base = stm32_rcc_base();

	for (i = 0; i < count; i++)
		io_write32(base + cfg[i].offset, cfg[i].value);
}

static void disable_kernel_clocks(void)
{
	const uint32_t ker_mask = RCC_OCENR_HSIKERON |
				  RCC_OCENR_CSIKERON |
				  RCC_OCENR_HSEKERON;

	/* Disable all ck_xxx_ker clocks */
	io_write32(stm32_rcc_base() + RCC_OCENCLRR, ker_mask);
}

static void enable_kernel_clocks(void)
{
	uintptr_t rcc_base = stm32_rcc_base();
	uint32_t reg = 0;
	const uint32_t ker_mask = RCC_OCENR_HSIKERON |
				  RCC_OCENR_CSIKERON |
				  RCC_OCENR_HSEKERON;

	/* Enable ck_xxx_ker clocks if ck_xxx was on */
	reg = io_read32(rcc_base + RCC_OCENSETR) << 1;
	io_write32(rcc_base + RCC_OCENSETR, reg & ker_mask);
}

static void clear_rcc_reset_status(void)
{
	/* Clear reset status fields */
	io_write32(stm32_rcc_base() + RCC_MP_RSTSCLRR, 0);
}

void stm32mp1_clk_save_context_for_stop(void)
{
	enable_kernel_clocks();
	save_mcu_subsys_clocks();
	save_pll34_state();
}

void stm32mp1_clk_restore_context_for_stop(void)
{
	restore_pll34_state();
	/* Restore MCU clock source after PLL3 is ready */
	restore_mcu_subsys_clocks();
	disable_kernel_clocks();
}

static bool backup_clock_nsec[NB_GATES];

static void sync_non_secure_clk_state(void)
{
	unsigned int idx = 0;

	for (idx = 0; idx < NB_GATES; idx++) {
		struct stm32mp1_clk_gate const *gate = gate_ref(idx);
		struct clk *clk = NULL;

		clk = clock_id_to_clk(gate->clock_id);
		assert(clk);

		if (__clk_is_enabled(gate) && !clk_is_enabled(clk))
			backup_clock_nsec[idx] = true;
		else
			backup_clock_nsec[idx] = false;
	}
}

static void stm32_clock_suspend(void)
{
	sync_non_secure_clk_state();
	backup_regular_cfg();
	backup_sc_cfg();
	backup_mux_cfg();
	save_pll34_state();

	enable_kernel_clocks();
	clear_rcc_reset_status();
}

static void stm32_clock_resume(void)
{
	unsigned int idx = 0;

	restore_pll34_state();
	restore_mux_cfg();
	restore_sc_cfg();
	restore_regular_cfg();

	/* Sync secure and shared clocks physical state on functional state */
	for (idx = 0; idx < NB_GATES; idx++) {
		struct stm32mp1_clk_gate const *gate = gate_ref(idx);
		struct clk *clk = NULL;

		if (backup_clock_nsec[idx])
			continue;

		clk = clock_id_to_clk(gate->clock_id);
		assert(clk);

		if (clk_is_enabled(clk)) {
			DMSG("Force clock %d enable", gate->clock_id);
			__clk_enable(gate);
		} else {
			DMSG("Force clock %d disable", gate->clock_id);
			__clk_disable(gate);
		}
	}

	disable_kernel_clocks();
}

static TEE_Result stm32_clock_pm(enum pm_op op, unsigned int pm_hint __unused,
				 const struct pm_callback_handle *hdl __unused)
{
	if (op == PM_OP_SUSPEND) {
		/* Make sure the pending operations are visible */
		dsb();
		stm32_clock_suspend();
	} else {
		pll1_config_from_opp_khz(current_opp_khz);
		stm32_clock_resume();
		/* Make sure the clock are restored */
		dsb();
	}

	return TEE_SUCCESS;
}
DECLARE_KEEP_PAGER(stm32_clock_pm);


void stm32_reset_system(void)
{
	vaddr_t rcc = stm32_rcc_base();

	/* Make sure the pending operations are visible */
	dsb();

	io_write32(rcc + RCC_MP_GRSTCSETR, RCC_MP_GRSTCSETR_MPSYSRST);
}
